OdDAI.Logical.op_Implicit~OdAnsiString
\details
Casts the Logical object's value to an ANSI string.

OdDAI.Logical.op_ExclusiveOr(OdDAI.Logical!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
A  "XOR" operator for the Logical data type.
\param other [in] Another Logical object (right-handed operand of the "OR" operation).
\returns The resulted Logical object.
\remarks
Implementation according to the ISO 10303-11, 12.4.4.

OdDAI.Logical.op_LogicalOr(OdDAI.Logical!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
A union ("OR") operator for the Logical data type.
\param other [in] Another Logical object (right-handed operand of the "OR" operation).
\returns The resulted Logical object.
\remarks
Implementation according to the ISO 10303-11, 12.4.3.

OdDAI.Logical.op_LogicalAnd(OdDAI.Logical!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
An intersection ("AND") operator for the Logical data type.
\param other [in] Another Logical object (right-handed operand of the "AND" operation).
\returns The resulted Logical object.
\remarks
Implementation according to the ISO 10303-11, 12.4.2.

OdDAI.Logical.op_LogicalNot
\details
A negation ("NOT") operator for the Logical data type.
Inverts the Logical object value:
* from True into False.
* from False into True
* in all other cases the operator returns the Unknown value.
\returns The Logical object that has the inverted value.
\remarks
Implementation according to the ISO 10303-11, 12.4.1.

OdDAI.Logical.op_Inequality(OdDAI.Logical!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
A non-equality operator for the Logical data type.
\param other [in] Another Logical object to be compared with (the right-hand operand of the comparison operation).
\returns true if Logical objects are NOT equal; otherwise, the method returns false.

OdDAI.Logical.op_Equality(OdDAI.Logical!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
An equality operator for the Logical data type.
\param other [in] Another Logical object to be compared with (the right-hand operand of the comparison operation).
\returns true if Logical objects are equal; otherwise, the method returns false.

OdDAI.Logical.op_Assign(OdAnsiString!System.Runtime.CompilerServices.IsConst*!System.Runtime.CompilerServices.IsImplicitlyDereferenced)
\details
Assignment operator for the Boolean data type.
The operator casts specified ANSI string
to the Boolean value and assigns it to the object.
\param val [in] An ANSI string to be assigned (a right-hand operand of the assignment operation).
\returns The reference to the Boolean object modified by the assignment operation.
\remarks
The specified ANSI string should be:
* "F" to set the Boolean object to the False value.
* "T" to set the Boolean object to the True value.
In all other cases, the operator makes the Boolean object unset.

OdDAI.Logical.op_Assign(System.Int32!System.Runtime.CompilerServices.IsLong!System.Runtime.CompilerServices.IsConst)
\details
Assignment operator for the Logical data type.
The operator casts specified signed long value to the Logical value and assigns it to the object.
\param val [in] A signed long data type value to be assigned (a right-hand operand of the assignment operation).
\returns The reference to the Logical object modified by the assignment operation.

OdDAI.Logical.#ctor(System.Int32)
\details
Creates a new Logical object with a specified signed int value.
\param i [in] A signed int value to be cast into a value of the created Logical object.

OdDAI.Logical.#ctor(OdDAI.Logical_)
\details
Creates a new Logical object with a specified value.
\param val [in] An initial value of the created Logical object.

OdDAI.Logical.#ctor
\details
Creates a new Logical object with an unset value.

OdDAI.Logical
\details
A class that represents the SDAI primitive Boolean data type.